
## Plan Result (test)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.api_mgmt_product.azurerm_api_management_product.product
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;get-people&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;get-people-by-params&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-people&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/products/hmi-product-test"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-test"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-test"
      + published             = (known after apply)
      + resource_group_name   = "ss-test-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["get-people"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/apis/hmi-apim/operations/get-people"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["get-people-by-params"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/apis/hmi-apim/operations/get-people-by-params"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-people"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/apis/hmi-apim/operations/update-people"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":106,"Program":"tfcmt","SHA1":"","Target":"test","Vars":{}} -->